/* ===========================================================================================================
 
     █████╗  ██╗      ███████╗ ██╗  ██╗  █████╗  ███╗  ██╗ ██████╗  ██████╗  ██╗   ██╗ ██╗ ███╗  ██╗ ██╗   ██╗
    ██╔══██╗ ██║      ██╔════╝ ╚██╗██╔╝ ██╔══██╗ ████╗ ██║ ██╔══██╗ ██╔══██╗ ██║   ██║ ██║ ████╗ ██║ ██║   ██║
    ███████║ ██║      █████╗    ╚███╔╝  ███████║ ██╔██╗██║ ██║  ██║ ██████╔╝ ██║   ██║ ██║ ██╔██╗██║ ╚██╗ ██╔╝
    ██╔══██║ ██║      ██╔══╝    ██╔██╗  ██╔══██║ ██║╚████║ ██║  ██║ ██╔══██╗ ██║   ██║ ██║ ██║╚████║  ╚████╔╝ 
    ██║  ██║ ███████╗ ███████╗ ██╔╝╚██╗ ██║  ██║ ██║ ╚███║ ██████╔╝ ██║  ██║ ╚██████╔╝ ██║ ██║ ╚███║   ╚██╔╝  
    ╚═╝  ╚═╝ ╚══════╝ ╚══════╝ ╚═╝  ╚═╝ ╚═╝  ╚═╝ ╚═╝  ╚══╝ ╚═════╝  ╚═╝  ╚═╝  ╚═════╝  ╚═╝ ╚═╝  ╚══╝    ╚═╝   

    Forged in fire by the gods, fighting through trials, yet here I rise, Invictus!

    =========================================================================================================== */

#include <bits/stdc++.h>
using namespace std;

constexpr int mod = 1000000007;

// ifstream fin("input.in");
// ofstream fout("output.out");
// #define cin fin
// #define cout fout

namespace Define {
    #define all(x) (x).begin(), (x).end()
    #define all1(x) ++(x).begin(), (x).end()
    #define rall(x) (x).rbegin(), (x).rend()
    #define rall1(x) (x).rbegin(), --(x).rend()
    using ll = long long;
    constexpr long long infBig = numeric_limits<long long> :: max() - 24;
    constexpr long long infMid = 1e15;
    constexpr int inf = numeric_limits<int> :: max() - 24;
    constexpr int infSmall = 1e9;
}
using namespace Define;

void Execute() {
    
    

}

constexpr bool activateMultipleTests = false;
int main() {

    ios_base::sync_with_stdio(false); cin.tie(nullptr);

    int numberOfTests = 1;
    if (activateMultipleTests) {
        cin >> numberOfTests;
    }

    for (int testNr = 1; testNr <= numberOfTests; ++testNr) {
        Execute();
    }

    return 0;
}